-- MySQL dump 10.13  Distrib 8.0.27, for Linux (x86_64)
--
-- Host: localhost    Database: report
-- ------------------------------------------------------
-- Server version	8.0.27

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Current Database: `report`
--

CREATE DATABASE /*!32312 IF NOT EXISTS*/ `report` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;

USE `report`;

--
-- Table structure for table `account`
--

DROP TABLE IF EXISTS `account`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `account` (
  `teacher_name` varchar(255) NOT NULL,
  `username` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  PRIMARY KEY (`teacher_name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `account`
--

LOCK TABLES `account` WRITE;
/*!40000 ALTER TABLE `account` DISABLE KEYS */;
INSERT INTO `account` VALUES ('赵思文','2200000160','Kwxy2000');
/*!40000 ALTER TABLE `account` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bot`
--

DROP TABLE IF EXISTS `bot`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `bot` (
  `bot_id` varchar(255) NOT NULL,
  `port` int NOT NULL,
  `status` int DEFAULT NULL COMMENT '1正常，0停止\n',
  PRIMARY KEY (`bot_id`),
  UNIQUE KEY `bot_port_uindex` (`port`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='机器人列表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bot`
--

LOCK TABLES `bot` WRITE;
/*!40000 ALTER TABLE `bot` DISABLE KEYS */;
INSERT INTO `bot` VALUES ('2793287265',5701,1);
/*!40000 ALTER TABLE `bot` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bot_request`
--

DROP TABLE IF EXISTS `bot_request`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `bot_request` (
  `request_id` int NOT NULL AUTO_INCREMENT,
  `flag` varchar(255) NOT NULL,
  `bot_id` varchar(255) NOT NULL,
  `type` int NOT NULL COMMENT '1-friend\n0-group',
  `target_id` varchar(255) NOT NULL,
  `comment` varchar(255) DEFAULT NULL,
  `create_time` datetime NOT NULL,
  PRIMARY KEY (`request_id`)
) ENGINE=InnoDB AUTO_INCREMENT=24 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bot_request`
--

LOCK TABLES `bot_request` WRITE;
/*!40000 ALTER TABLE `bot_request` DISABLE KEYS */;
INSERT INTO `bot_request` VALUES (23,'1652421967837761','2793287265',0,'1377875184','','2022-05-13 14:06:08');
/*!40000 ALTER TABLE `bot_request` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `clazz`
--

DROP TABLE IF EXISTS `clazz`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `clazz` (
  `clazz_name` varchar(255) NOT NULL,
  `teacher_name` varchar(255) DEFAULT NULL,
  `date` varchar(255) NOT NULL,
  `dept_id` varchar(255) NOT NULL,
  `group_id` varchar(255) NOT NULL,
  `bot_port` varchar(255) NOT NULL,
  `delete` int NOT NULL COMMENT '开启撤回 1 \n关闭撤回 0',
  PRIMARY KEY (`clazz_name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `clazz`
--

LOCK TABLES `clazz` WRITE;
/*!40000 ALTER TABLE `clazz` DISABLE KEYS */;
INSERT INTO `clazz` VALUES ('18数据',NULL,'2022.4.10','147331','825909952','5701',1),('19数据',NULL,'2022.5.10','1234','1234','5700',1),('19软件2',NULL,'2022.4.10','147372','1087894326','5700',0),('20数据',NULL,'2022.4.10','236630','945219184','5700',1),('20软件2','赵思文','2022.4.10','236628','953152455','5700',0);
/*!40000 ALTER TABLE `clazz` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `friend_list`
--

DROP TABLE IF EXISTS `friend_list`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `friend_list` (
  `bot_id` varchar(255) NOT NULL,
  `user_id` varchar(255) NOT NULL,
  `nickname` varchar(255) NOT NULL,
  `remark` varchar(255) NOT NULL,
  `mark` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`bot_id`,`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `friend_list`
--

LOCK TABLES `friend_list` WRITE;
/*!40000 ALTER TABLE `friend_list` DISABLE KEYS */;
INSERT INTO `friend_list` VALUES ('2793287265','1377875184','1377875184','治怒善男',NULL),('2793287265','1427774041','1427774041','ice_water',NULL),('2793287265','2793287265','2793287265','治怒善男',NULL),('2793287265','66600000','66600000','babyQ',NULL);
/*!40000 ALTER TABLE `friend_list` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `group_list`
--

DROP TABLE IF EXISTS `group_list`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `group_list` (
  `bot_id` varchar(255) NOT NULL,
  `group_id` varchar(255) NOT NULL,
  `group_name` varchar(255) NOT NULL,
  `max_member_count` int NOT NULL,
  `member_count` int NOT NULL,
  `mark` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`bot_id`,`group_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `group_list`
--

LOCK TABLES `group_list` WRITE;
/*!40000 ALTER TABLE `group_list` DISABLE KEYS */;
INSERT INTO `group_list` VALUES ('2793287265','1003209156','小窝',200,6,NULL),('2793287265','1030838056','*',200,4,NULL),('2793287265','369746384','实干青年 - 老年人活动中心',200,11,NULL);
/*!40000 ALTER TABLE `group_list` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `message`
--

DROP TABLE IF EXISTS `message`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `message` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `bot_id` varchar(255) NOT NULL,
  `message` varchar(255) NOT NULL,
  `target_id` varchar(255) NOT NULL COMMENT '发送目标，可能是群组也可能是私信，为群号或QQ账号\n',
  `type` int NOT NULL COMMENT '0是群组，1是私信',
  `send_time` datetime NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='使用机器人发送的消息';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `message`
--

LOCK TABLES `message` WRITE;
/*!40000 ALTER TABLE `message` DISABLE KEYS */;
/*!40000 ALTER TABLE `message` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `student`
--

DROP TABLE IF EXISTS `student`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `student` (
  `student_id` varchar(255) NOT NULL,
  `student_qq` varchar(255) NOT NULL,
  `student_name` varchar(255) NOT NULL,
  `student_clazz` varchar(255) NOT NULL,
  `remove` int NOT NULL DEFAULT '0' COMMENT '是否不在班级内，0在，1不在\n（参军或休学或其他情况）',
  PRIMARY KEY (`student_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `student`
--

LOCK TABLES `student` WRITE;
/*!40000 ALTER TABLE `student` DISABLE KEYS */;
INSERT INTO `student` VALUES ('111','11122222121','王建文1','19数据',0),('112','112','王建文2','19数据',0),('113','113','王建文3','19数据',0),('114','114','王建文4','19数据',0),('115','115','王建文5','19数据',0),('116','116','王建文6','19数据',0),('117','117','王建文7','19数据',0),('118','118','王建文8','19数据',0),('119','119','王建文9','19数据',0),('178334222','309619403','李康','19软件2',0),('180825238','1916757301','宋子璇','19软件2',0),('180825245','1345666253','王诗雨','19软件2',0),('180825249','536327120','王宇欣','19软件2',0),('180827101','1607720953','陈炳寰','18数据',0),('180827102','1356353729','陈沛','18数据',0),('180827103','1514443449','陈世伦','18数据',0),('180827104','2473330993','程轲','18数据',0),('180827105','3137791187','褚奉民','18数据',0),('180827106','573507487','丁雯','18数据',0),('180827108','1021245536','杜晓轩','18数据',0),('180827109','1806881429','樊科','18数据',0),('180827110','1046500875','封一鸣','18数据',0),('180827111','2017630558','高标','18数据',0),('180827112','876985645','关心怡','18数据',0),('180827113','1474251744','韩溢铢','18数据',0),('180827114','1546749868','胡传钢','18数据',0),('180827115','1029882083','黄俊华','18数据',0),('180827116','1029692927','黄楠','18数据',0),('180827117','1579217496','江婉琪','18数据',0),('180827118','1546305908','蒋亢杰','18数据',0),('180827119','2502439129','李川','18数据',0),('180827120','1295154071','李沛瑾','18数据',0),('180827121','1654826315','李希伟','18数据',0),('180827122','1060864911','李炎玺','18数据',0),('180827123','2376441554','梁源','18数据',0),('180827124','809976462','林海燕','18数据',0),('180827125','1056644093','刘曜慧','18数据',0),('180827126','1426018272','刘盈','18数据',0),('180827127','1025951846','罗劭彦','18数据',0),('180827128','1095365233','吕晗丽','18数据',0),('180827129','2419363229','马慧奇','18数据',0),('180827131','183505678','乔靖杰','18数据',0),('180827132','3600013695','盛洁','18数据',0),('180827133','2745716636','石新伟','18数据',0),('180827134','1605051832','史程伟','18数据',0),('180827135','1276674734','王彩霞','18数据',0),('180827136','2210492129','王晨雨','18数据',0),('180827137','1848685904','王建国','18数据',0),('180827138','1755484895','王丽萍','18数据',0),('180827140','709887371','王永辉','18数据',0),('180827141','3050870263','王语','18数据',0),('180827142','2624509092','吴可秦','18数据',0),('180827143','809294927','武小涵','18数据',0),('180827144','446078839','夏玮','18数据',0),('180827145','1019943758','夏雨','18数据',0),('180827146','1501571050','肖一','18数据',0),('180827147','253918670','徐卫中','18数据',0),('180827148','2914543970','杨程','18数据',0),('180827149','1415674799','杨淳惠','18数据',0),('180827150','1018472132','杨玉堃','18数据',0),('180827151','1031130284','于雪莲','18数据',0),('180827152','3285485668','张丽华','18数据',0),('180827153','320976399','张泰铭','18数据',0),('180827154','2623279137','张淘','18数据',0),('180827155','1161098105','赵锐敏','18数据',0),('180827156','1102969940','周航','18数据',0),('180827157','1186433079','周佳敏','18数据',0),('180827158','826694415','周贞雄','18数据',0),('180827159','105130110','朱晨曦','18数据',0),('180827160','3529411304','朱帅波','18数据',0),('7190764202','1791260858','蔡伟毅','19软件2',0),('7190764203','603226819','陈力列','19软件2',0),('7190764204','2418251700','陈龙','19软件2',0),('7190764205','1115448506','陈强龙','19软件2',0),('7190764206','1025976605','程莉莉','19软件2',0),('7190764207','996344589','单香怡','19软件2',0),('7190764208','1500387706','丁诺','19软件2',0),('7190764209','1327136691','费宇豪','19软件2',0),('7190764211','572713539','付翔宇','19软件2',0),('7190764212','2276872110','高武','19软件2',0),('7190764213','2826877129','郝一鸣','19软件2',0),('7190764215','981961894','何香泳','19软件2',0),('7190764216','441977824','侯超','19软件2',0),('7190764217','1617268588','黄明娟','19软件2',0),('7190764218','1250651074','黄亦婷','19软件2',0),('7190764219','1529212762','贾晟毅','19软件2',0),('7190764220','907949114','江培松','19软件2',0),('7190764221','2681248139','江双双','19软件2',0),('7190764222','2895799065','李海燕','19软件2',0),('7190764223','1015611693','李敏','19软件2',0),('7190764224','819508292','李鹏龙','19软件2',0),('7190764225','1226205679','李若冰','19软件2',0),('7190764226','206460950','李渊睿','19软件2',0),('7190764227','848782369','刘奔','19软件2',0),('7190764228','1738675921','刘建宏','19软件2',0),('7190764229','1424383589','刘雅平','19软件2',0),('7190764231','1779849981','刘雅婷','19软件2',0),('7190764232','2508838514','刘振林','19软件2',0),('7190764233','3530637699','陆雪艳','19软件2',0),('7190764234','1115019327','毛小伟','19软件2',0),('7190764235','1721488387','彭曙光','19软件2',0),('7190764236','1799239677','强璇','19软件2',0),('7190764237','1069395062','申刘宝','19软件2',0),('7190764238','2890514017','师伟','19软件2',0),('7190764240','2064363526','苏颖','19软件2',0),('7190764241','1282261438','汤欣怡','19软件2',0),('7190764242','1538573929','童家定','19软件2',0),('7190764243','3270095598','王必滨','19软件2',0),('7190764244','1226559461','王晨宇','19软件2',0),('7190764245','2453258835','王娜','19软件2',0),('7190764246','1758003138','王晓莉','19软件2',0),('7190764247','1729965457','王晓晓','19软件2',0),('7190764248','2396978763','王瑀霖','19软件2',0),('7190764249','1446982638','王正','19软件2',0),('7190764250','2900208198','尉鑫鑫','19软件2',0),('7190764251','1741459386','吴梦莹','19软件2',0),('7190764252','1401545517','向肖晗','19软件2',0),('7190764253','2631509949','徐傲','19软件2',0),('7190764254','1969717812','徐小琳','19软件2',0),('7190764255','3383405990','许霞','19软件2',0),('7190764256','1932586701','严凯敏','19软件2',0),('7190764258','2549590734','杨畅','19软件2',0),('7190764259','1415123546','杨璟燊','19软件2',0),('7190764260','1093394030','杨婷','19软件2',0),('7190764262','1606492982','占帅帅','19软件2',0),('7190764263','1443668388','张涵','19软件2',0),('7190764266','2509141720','张妙妍','19软件2',0),('7190764267','3029917557','张娴','19软件2',0),('7190764268','1397245269','张依婷','19软件2',0),('7190764269','630017682','章宏霄','19软件2',0),('7190764270','2440913157','甄子函','19软件2',0),('7190764271','2608454567','郑文婷','19软件2',0),('7190764272','1667459851','周婷','19软件2',0),('7190764273','1563361033','周艺博','19软件2',0),('7190764274','1913800785','周政伟','19软件2',0),('7190764275','985937844','朱霏','19软件2',0),('7190764276','291774830','朱新茹','19软件2',0),('7190764277','3506676171','卓庆','19软件2',0),('7190764278','2429711889','左蓉蓉','19软件2',0),('7190764281','1695893380','姚慧静','19软件2',0),('7190777144','853579314','席浩迅','20软件2',0),('7200634152','2316501367','张曼','20软件2',0),('7200762112','840066450','江舟','20软件2',0),('7200764201','2470684840','包智予','20软件2',0),('7200764202','2499869608','蔡紫旋','20软件2',0),('7200764203','2781468167','陈蝶','20软件2',0),('7200764204','2653090107','陈华俊','20软件2',1),('7200764205','2909235457','陈琦','20软件2',0),('7200764206','3141158350','陈爽','20软件2',1),('7200764207','1282676341','陈烨','20软件2',0),('7200764208','1499593995','崔波','20软件2',0),('7200764209','2410323243','戴衍','20软件2',0),('7200764210','2235357497','范金生','20软件2',0),('7200764211','1776565000','方浩扬','20软件2',0),('7200764212','769591414','房晨宇','20软件2',0),('7200764213','2529315991','关星月','20软件2',0),('7200764214','2145039799','郭雨钿','20软件2',0),('7200764215','2430485450','何伟','20软件2',0),('7200764217','1482193676','黄潇','20软件2',0),('7200764218','758766041','黄艳阳','20软件2',0),('7200764219','2501116423','蒋益','20软件2',0),('7200764220','1520379867','李锦松','20软件2',1),('7200764221','2904641709','李苏杰','20软件2',0),('7200764222','2759638913','李晓婧','20软件2',0),('7200764223','960919037','李晓同','20软件2',0),('7200764224','2585443920','李雅婧','20软件2',1),('7200764225','741349469','李雨欣','20软件2',0),('7200764227','1757724386','刘嗣帅','20软件2',0),('7200764229','2494344138','陆小茜','20软件2',0),('7200764230','2969787424','陆雅婷','20软件2',0),('7200764231','2428286276','马晨曦','20软件2',0),('7200764232','3031531805','马新萍','20软件2',0),('7200764233','421712537','彭海洋','20软件2',0),('7200764234','673576534','沈依青','20软件2',0),('7200764235','2643109172','孙爱琳','20软件2',1),('7200764236','183268352','孙创业','20软件2',0),('7200764237','763039204','孙重祎','20软件2',0),('7200764238','2734076433','王迪','20软件2',1),('7200764239','2834024743','王嘉明','20软件2',1),('7200764240','2251145976','王诗琪','20软件2',0),('7200764241','2044435806','王玮瑶','20软件2',0),('7200764242','2593658505','吴京','20软件2',1),('7200764243','732788562','吴征昊','20软件2',0),('7200764244','2680260895','吴紫茜','20软件2',1),('7200764245','2959674812','谢逸凡','20软件2',0),('7200764246','2753757325','行孟杰','20软件2',1),('7200764247','1452046928','徐冰清','20软件2',0),('7200764248','2293923761','徐程','20软件2',0),('7200764249','1262296187','徐志龙','20软件2',0),('7200764250','1569245448','严雯','20软件2',1),('7200764251','2234421866','张凤飞','20软件2',0),('7200764252','2939934570','张洪婉','20软件2',0),('7200764253','571807394','张磊','20软件2',0),('7200764255','1908045405','张茂','20软件2',0),('7200764256','1458335158','张彦伟','20软件2',0),('7200764257','2563787865','张阳','20软件2',0),('7200764258','2282161961','赵惠杰','20软件2',0),('7200764259','2105339715','赵林林','20软件2',0),('7200764260','1924507651','郑梦可','20软件2',0),('7200764299','2571940933','朱茜茜','20软件2',1),('7200766101','1466002658','陈佳裕','20数据',0),('7200766102','2411954749','陈可昕','20数据',0),('7200766103','2981712004','陈森','20数据',0),('7200766106','1178127896','杜宛蓉','20数据',0),('7200766107','1959209891','杜芷若','20数据',0),('7200766108','3394532894','段丽新','20数据',0),('7200766109','3536987271','范彩云','20数据',0),('7200766110','2114940672','方明暄','20数据',0),('7200766111','1814783395','高丽','20数据',0),('7200766112','2196155975','高萌','20数据',0),('7200766113','2303812413','弓艾丽','20数据',0),('7200766114','2435257655','顾佳君','20数据',0),('7200766115','2943882089','郭楠楠','20数据',0),('7200766116','1348964821','何雅珣','20数据',0),('7200766117','859437529','何洋','20数据',0),('7200766118','2667096287','黄大俊','20数据',0),('7200766119','3407202995','季泽','20数据',0),('7200766120','3357457720','贾燕霞','20数据',0),('7200766121','934034168','柯楠','20数据',0),('7200766122','3062393700','孔雪梅','20数据',0),('7200766123','1569036587','李佳慧','20数据',0),('7200766124','2371453667','李佳奇','20数据',0),('7200766126','2481668585','李云梦','20数据',0),('7200766127','3431844035','李紫微','20数据',0),('7200766128','2861321865','梁梦华','20数据',0),('7200766129','1136971913','林欣雨','20数据',0),('7200766131','1091120294','陆怡静','20数据',0),('7200766132','209617832','吕晨搏','20数据',0),('7200766133','3253382667','孟蕊','20数据',0),('7200766134','3120489147','倪颖','20数据',0),('7200766135','2380484650','钱轶瑶','20数据',0),('7200766136','2194159100','饶克奎','20数据',0),('7200766137','1505617741','阮珠霖','20数据',0),('7200766138','465386317','盛思浩','20数据',0),('7200766139','1149723425','施承志','20数据',0),('7200766140','2970237687','宋盈盈','20数据',0),('7200766141','2798976142','孙茹茹','20数据',0),('7200766143','1223141458','唐夏懿','20数据',0),('7200766144','2213535079','王辛薇','20数据',0),('7200766145','1303297380','王雅琪','20数据',0),('7200766146','1910822079','韦松','20数据',0),('7200766147','705192968','徐雕','20数据',0),('7200766148','2673380881','徐佳佳','20数据',0),('7200766149','1400305533','徐卓宇','20数据',0),('7200766150','1252594553','颜千慧','20数据',0),('7200766151','2320869780','余烨滨','20数据',0),('7200766152','2215291943','张丹','20数据',0),('7200766153','2558464414','张青鹏','20数据',0),('7200766154','3197367918','张妍琳','20数据',0),('7200766155','1650293672','赵茂','20数据',0),('7200766156','2439194671','周静雯','20数据',0),('7200766157','203516291','朱林','20数据',0),('7200766158','1256066356','朱宇','20数据',0),('7200772108','2310701779','翟林炜','20数据',0);
/*!40000 ALTER TABLE `student` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-05-17  1:10:35
